Revit 2026 API

# AddInId Properties

---

The AddInId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

AddInId Class

Autodesk.Revit.DB Namespace